---
kind: property
id: P:Autodesk.Revit.DB.Extrusion.Sketch
source: html/53ea6889-85a4-9c99-caf5-3c3e6d507f0e.htm
---
# Autodesk.Revit.DB.Extrusion.Sketch Property

Returns the Sketch of the Extrusion.

## Syntax (C#)
```csharp
public Sketch Sketch { get; }
```

## Remarks
This property is used to retrieve the Sketches of the Extrusion.